cask_args appdir: "/Applications"

tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Bash utilities
brew "bash-completion"
brew "coreutils"
brew "findutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gnutls"
brew "moreutils"
brew "wget"

# Libraries
brew "libpng"
brew "libtool"
brew "freetype"
brew "webp"

# Tools
brew "awscli"
brew "carthage"
brew "cloc"
brew "curl", args: ["with-nghttp2"]
brew "exiftool"
brew "ffmpeg"
brew "git"
brew "git-lfs"
brew "graphviz"
brew "heroku/brew/heroku"
brew "hub"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "mergepbx"
brew "qrencode"
brew "scrypt"
brew "speedtest-cli"
brew "sqlcipher"
brew "step"
brew "swiftlint"
brew "tarsnap"

# Android
brew "ant"
brew "maven"
brew "gradle"

cask "android-sdk"

# Languages
brew "n"
brew "ruby"
cask "homebrew/cask-versions/java8"

# Databases
brew "arangodb", restart_service: :changed
brew "mongodb", restart_service: :changed
brew "mysql", restart_service: :changed
brew "postgresql", restart_service: :changed
brew "sqlite"

# Compression
brew "p7zip"
brew "xz"
brew "zlib"

# Mac app store
brew "mas"
mas "Agenda", id:1287445660
mas "Day One", id:1055511498
mas "DevCleaner", id:1388020431
mas "GIF Brewery 3", id:1081413713
mas "GarageBand", id:682658836
mas "iMovie", id:408981434
mas "Keynote", id:409183694
mas "Kindle", id:405399194
mas "Numbers", id:409203825
mas "Pages", id:409201541
mas "Speedtest", id:1153157709
mas "Tweetbot", id:1384080005
mas "xScope", id:889428659

# Apps
cask "1password"
cask "1password-cli"
cask "alfred"
cask "anki"
cask "appcode"
cask "backblaze"
cask "bibdesk"
cask "dropbox"
cask "fastlane"
cask "google-chrome"
cask "keycastr"
cask "p4v"
cask "quickbooks-online"
cask "rocket"
cask "sketch"
cask "sketch-toolbox"
cask "skype"
cask "slack"
cask "superduper"
cask "tower"
cask "visual-studio-code"
cask "xmind"
cask "zoomus"

# Tentative
brew "bitrise"
brew "travis"

cask "grammarly"
cask "microsoft-teams"
cask "monodraw"
cask "moom"
cask "zettlr"
